class Presets(object):
    WELCOME_TXT = "<b>مرحبا 👨🏻‍🎓👩🏻‍🎓  {}</b>\n<i> أنا بوت أقوم بضغط ملف pdf لك الى حجم اقل" \
                  "جرب وسوف ترى بنفسك</i>"
    INVALID_FORMAT = "<b>خطا:</b>\n<i>يمكنني ضغط مستندات pdf فقط. من فضلك تأكد من أنك أعطيتني أ" \
                     "وثيقة صالحة. حاول مجددا...</i>"
    WAIT_MESSAGE = "⌛️ <b>Processing(معالجة)</b> ⌛"
    DOWNLOAD_MSG = "⌛️ <b>Downloading(تحميل)</b> ⌛"
    UPLOAD_MSG = "⌛️ <b>Uploading(رفع)</b> ⌛"
    FINISHED_BAR = "◼️"
    UN_FINISHED_BAR = "◻️"
    FINISHED_DL = "<b>نجاح !</b>\n<i>تم تنزيل المستند بنجاح.</i>"
    START_COMPRESSING = "⌛️ <b>معالجة</b>  ⌛\n<i>محاولة ضغط المستند</i>"
    FINISHED_JOB = "<b>نجاح</b> ✅ \n\n<i>Size before job(الحجم قبل العمل): {}\nSize after job(الحجم بعد العمل): {}\n\nمطور: </i><a " \
                   "href='https://t.me/ta_ja199'><b> @ta_ja199</b></a> "
    JOB_ERROR = "<b>خطا:</b>\n<i>هناك خطأ ما ! تم الخروج من العملية</i>"
